<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"012b7a62abaadb88cd51b4e08a0805725f3ca3c4ce05d9dd0b71d93be2080d7c","plan_job_ref":"Job Create Terraform plan (DEV) #184 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15471374017","plan_out_hash":"657f594941651ec7be714c165f8bf3ba4c4f98cb58af79dd17d9c6d67afcb719","plan_hash":"6b5d6c1e936b99931241e3295b0b84cf26e94d0a332d06a0c463996ddac1f61c","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 4 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.cert_manager will be created
+   resource "helm_release" "cert_manager" {
+       atomic                     = false
+       chart                      = "cert-manager"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cert-manager"
+       namespace                  = "cert-manager"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.jetstack.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                crds:
                  enabled: true
            EOT,
        ]
+       verify                     = false
+       version                    = "v1.17.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.openmrs will be created
+   resource "helm_release" "openmrs" {
+       atomic                     = false
+       chart                      = "openmrs"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "openmrs"
+       namespace                  = "openmrs"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "oci://registry-1.docker.io/openmrs"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                ---
                # Global settings
                global:
                  defaultStorageClass: "default"
                
                # OpenMRS Backend settings
                openmrs-backend:
                  image:
                    tag: "latest"
                    repository: "openmrsacrdev.azurecr.io/openmrscore-backend"
                
                # OpenMRS Frontend settings
                openmrs-frontend:
                  image:
                    tag: "latest"
                    repository: "openmrsacrdev.azurecr.io/openmrscore-frontend"
                
                # OpenMRS Gateway settings
                openmrs-gateway:
                  image:
                    tag: "latest"
                    repository: "openmrsacrdev.azurecr.io/openmrscore-gateway"
                
                  service:
                    type: ClusterIP
                    port: 80
            EOT,
        ]
+       verify                     = false
+       version                    = "0.1.5"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubectl_manifest.cluster_issuer will be created
+   resource "kubectl_manifest" "cluster_issuer" {
+       api_version             = "cert-manager.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "ClusterIssuer"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "letsencrypt-prod"
+       namespace               = "cert-manager"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-prod
              namespace: cert-manager
            spec:
              acme:
                email: contact@audioprothese.ovh
                privateKeySecretRef:
                  name: letsencrypt-production
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - dns01:
                    azureDNS:
                      environment: AzurePublicCloud
                      hostedZoneName: audioprothese.ovh
                      managedIdentity:
                        clientID: c73d7ac2-894f-49f4-aee2-3cb50e17d508
                      resourceGroupName: rg-openmrscore-dev
                      subscriptionID: c2b90606-cc96-463f-aa06-70f32719fe4f
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.openmrs_ingress will be created
+   resource "kubectl_manifest" "openmrs_ingress" {
+       api_version             = "networking.k8s.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Ingress"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "openmrs-gateway-ingress"
+       namespace               = "openmrs"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: Ingress
            metadata:
              annotations:
                cert-manager.io/cluster-issuer: letsencrypt-prod
                nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
              name: openmrs-gateway-ingress
              namespace: openmrs
            spec:
              ingressClassName: webapprouting.kubernetes.azure.com
              rules:
              - host: openmrs.dev.audioprothese.ovh
                http:
                  paths:
                  - backend:
                      service:
                        name: gateway
                        port:
                          number: 80
                    path: /
                    pathType: Prefix
              tls:
              - hosts:
                - openmrs.dev.audioprothese.ovh
                secretName: openmrs-tls
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #184](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15471374017)